# 5.1 Основные стрктуры

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([['Anna', 23, 3], 
             ['Sam', 36, 12], 
             ['Bill', 33, 10],
             ['Moica', 25, 7],
             ['Lisa', 27, 7],
             ['Peter', 32, None]])

In [3]:
df[0]

0     Anna
1      Sam
2     Bill
3    Moica
4     Lisa
5    Peter
Name: 0, dtype: object

In [4]:
type(df)

pandas.core.frame.DataFrame

# 5.2 Индексы и метод .iloc

In [5]:
df.columns = ['name', 'age', 'expr'] #Изменение названий столбцов

In [6]:
df

    name  age  expr
0   Anna   23   3.0
1    Sam   36  12.0
2   Bill   33  10.0
3  Moica   25   7.0
4   Lisa   27   7.0
5  Peter   32   NaN

In [7]:
df.iloc[1, 2]

12.0

In [9]:
print(df.iloc[1:3, 1])

1    36
2    33
Name: age, dtype: int64

In [10]:
df.iloc[:, 0]

0     Anna
1      Sam
2     Bill
3    Moica
4     Lisa
5    Peter
Name: name, dtype: object

In [12]:
df['name'] # при строковой нумерации нормальная индексация сохраняется только в iloc

0     Anna
1      Sam
2     Bill
3    Moica
4     Lisa
5    Peter
Name: name, dtype: object

In [13]:
df[0:2] #При срезах указываются строки

   name  age  expr
0  Anna   23   3.0
1   Sam   36  12.0

# 5.3 Индексы и метод .loc

In [14]:
df[['name', 'expr']]

    name  expr
0   Anna   3.0
1    Sam  12.0
2   Bill  10.0
3  Moica   7.0
4   Lisa   7.0
5  Peter   NaN

In [16]:
df.index = df['name']
del df['name']

In [17]:
df

       age  expr
name
Anna    23   3.0
Sam     36  12.0
Bill    33  10.0
Moica   25   7.0
Lisa    27   7.0
Peter   32   NaN

In [18]:
df.loc['Bill', 'age']

33

In [19]:
df.loc['Sam':'Lisa', 'expr'] #В текстовых срезах последний элемент включается

name
Sam      12.0
Bill     10.0
Moica     7.0
Lisa      7.0
Name: expr, dtype: float64

In [21]:
df['Sam':'Lisa']

       age  expr
name
Sam     36  12.0
Bill    33  10.0
Moica   25   7.0
Lisa    27   7.0

# 5.4 Характеристики датафреймов pandas

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Anna to Peter
Data columns (total 2 columns):
age     6 non-null int64
expr    5 non-null float64
dtypes: float64(1), int64(1)
memory usage: 304.0+ bytes

In [23]:
df.shape

(6, 2)

In [24]:
df.describe() # std - standart deviation, размер разброса; % - квартили. н-р, 50 - медиана

             age       expr
count   6.000000   5.000000
mean   29.333333   7.800000
std     5.085928   3.420526
min    23.000000   3.000000
25%    25.500000   7.000000
50%    29.500000   7.000000
75%    32.750000  10.000000
max    36.000000  12.000000

In [25]:
df.columns #неизменяемый список

Index(['age', 'expr'], dtype='object')

# 5.5 Операции над датафреймами 1

In [26]:
df.head()

       age  expr
name
Anna    23   3.0
Sam     36  12.0
Bill    33  10.0
Moica   25   7.0
Lisa    27   7.0

In [27]:
df = df.dropna() #удаление строк с NaN

In [28]:
df

       age  expr
name
Anna    23   3.0
Sam     36  12.0
Bill    33  10.0
Moica   25   7.0
Lisa    27   7.0

In [31]:
df[df['age'] > 30]

      age  expr
name
Sam    36  12.0
Bill   33  10.0

# 5.6 Операции над датафреймами 2

In [32]:
df['age_sq'] = df['age'] ** 2

C:\Games\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [33]:
df

       age  expr  age_sq
name
Anna    23   3.0     529
Sam     36  12.0    1296
Bill    33  10.0    1089
Moica   25   7.0     625
Lisa    27   7.0     729

In [34]:
df['status'] = 'W'

C:\Games\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [35]:
df

       age  expr  age_sq status
name
Anna    23   3.0     529      W
Sam     36  12.0    1296      W
Bill    33  10.0    1089      W
Moica   25   7.0     625      W
Lisa    27   7.0     729      W

In [36]:
df['gender'] = [0, 1, 1, 0, 0]

C:\Games\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [37]:
df

       age  expr  age_sq status  gender
name
Anna    23   3.0     529      W       0
Sam     36  12.0    1296      W       1
Bill    33  10.0    1089      W       1
Moica   25   7.0     625      W       0
Lisa    27   7.0     729      W       0

In [38]:
df['no_work'] = df['age'] - df['expr']

C:\Games\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [39]:
df

       age  expr  age_sq status  gender  no_work
name
Anna    23   3.0     529      W       0     20.0
Sam     36  12.0    1296      W       1     24.0
Bill    33  10.0    1089      W       1     23.0
Moica   25   7.0     625      W       0     18.0
Lisa    27   7.0     729      W       0     20.0